---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle.BoltDiameterLongerFlange
source: html/4af1001d-b619-0f29-58ce-75a438d16ba1.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle.BoltDiameterLongerFlange Property

Maximum bolt hole diameter in the longer flange, in. (mm)

## Syntax (C#)
```csharp
public double BoltDiameterLongerFlange { get; set; }
```